import Accordeon from "../../../components/Accordeon.tsx";

const Block1 = () => {
    return (
        <section className="delivery-block delivery-block_1">
            <h3>Інформація про доставку</h3>
            <div className="delivery-block__info">
                <p>
                    Для зручності покупців діє кілька способів доставки товарів. Існує доставка по Києву,
                    доставка по регіонах України і самовивіз. Будь-який із способів доступний під час оформлення
                    замовлення через сайт або в операторів.
                </p>
                <p>Велосипеди та вело-станки доставляються в зібраному і налаштованому вигляді.</p>
                <p>
                    На будь-які питання щодо правил і вартості доставки дадуть відповідь оператор:
                    <a href="tel:380995675885">+38 099-56-75-885</a>
                </p>
            </div>
            <div className="delivery-block__faq">
                <Accordeon title="Доставка по Києву">
                    <ul className="t2">
                        <li>Замовлення вартістю до 20 тис. &#x20B4; - 1 000 &#x20B4;</li>
                        <li>Замовлення вартістю понад 20 тис. &#x20B4; - Безкоштовно</li>
                        <li>Доставка негабаритних товарів розраховується окремо.</li>
                        <li>
                            Термін доставки не більше 2 днів з моменту узгодження замовлення. При доставці по Києву
                            оплату товару можна здійснити кур'єру.
                        </li>
                    </ul>
                </Accordeon>
                <Accordeon title="Доставка по Київській області">
                    <ul className="t2">
                        <li>Доставка по Київській області здійснюється щодня, крім неділі.</li>
                        <li>Ми співпрацюємо з надійними кур'єрськими службами, щоб ви отримали своє замовлення вчасно.
                        </li>
                        <li>Термін доставки зазвичай становить від 1 до 3 робочих днів залежно від населеного пункту.
                        </li>
                        <li>
                            При замовленні на суму від 5000 грн доставка по Київській області безкоштовна.
                        </li>
                    </ul>
                </Accordeon>
                <Accordeon title="Доставка в інші регіони України">
                    <ul className="t2">
                        <li>Ми здійснюємо доставку велосипедів по всій території України.</li>
                        <li>Замовлення надсилаються перевіреними службами доставки, такими як Нова Пошта та Укрпошта.
                        </li>
                        <li>Термін доставки залежить від віддаленості регіону та зазвичай становить 2–5 робочих днів.
                        </li>
                        <li>Вартість доставки розраховується згідно з тарифами обраної служби доставки.</li>
                    </ul>
                </Accordeon>
                <Accordeon title="Магазин - пункт самовивозу в Києві">
                    <ul className="t2">
                        <li>Ви можете забрати своє замовлення безпосередньо з нашого магазину в Києві.</li>
                        <li>Самовивіз доступний після підтвердження замовлення менеджером.</li>
                        <li>Наш магазин зручно розташований і працює щоденно, окрім неділі.</li>
                        <li>При самовивозі ви можете оглянути товар перед покупкою та отримати консультацію.</li>
                    </ul>
                </Accordeon>
            </div>
        </section>
    );
};

export default Block1;