import Page from "../Page.tsx";
import Header from "../../components/Header.tsx";
import Footer from "../../components/Footer.tsx";
import Breadcrumbs, {BreadcrumbsItem} from "../../components/Breadcrumbs.tsx";
import Container from "../../components/Container.tsx";
import "../../scss/pages/blogItem.scss";
import React, {useRef, useState} from "react";
import Modal from "../../components/Modal.tsx";
import ReactPlayer from "react-player/lazy";
import UpBtn from "../../components/ui/UpBtn.tsx";

const BlogItemPage = () => {
    const [isActiveModal, setIsActiveModal] = React.useState(false);
    const [videoUrl, setVideoUrl] = useState<string>("");
    const playerRef = useRef<ReactPlayer | null>(null);

    const handleClickPlay = (e: React.MouseEvent<HTMLDivElement>) => {
        const target = e.target as HTMLDivElement;
        const container: HTMLDivElement | null = target.closest(".video");

        if (container && container.dataset.src) {
            if (playerRef.current) {
                playerRef.current?.seekTo(0);
            }

            setVideoUrl(container.dataset.src);
            setIsActiveModal(true);
        }
    }

    return (
        <>
            <Page title="Велосипед Wilier Grantismo SLR для шосейних перегонів" className="blog-item-page">
                <UpBtn/>
                <Header/>
                <Container className="blog-item-page__container">
                    <Breadcrumbs>
                        <BreadcrumbsItem link="/">Головна</BreadcrumbsItem>
                        <BreadcrumbsItem link="/blog">Блог</BreadcrumbsItem>
                        <BreadcrumbsItem isActive={true}>Велосипед Wilier Grantismo SLR для шосейних
                            перегонів</BreadcrumbsItem>
                    </Breadcrumbs>
                    <article className="content">
                        <section>
                            <h3>
                                Pinarello Dogma F розвиває карбоновий шосейний велосипед наступного покоління,
                                зберігаючи
                                можливість вибору ободного гальма!
                            </h3>
                            <div
                                onClick={handleClickPlay}
                                className="video"
                                data-src="https://youtu.be/wW1NItjd3_o?si=zstCS9x2pyxMhyzv"
                            >
                                <img
                                    src="/images/blogItem/video_bg.avif"
                                    className="video__bg"
                                    alt=""
                                />
                                <button
                                    className="btn video__play-btn"
                                    title="Відтворити"
                                >
                                    <svg width="53" height="60" viewBox="0 0 53 60" fill="none"
                                         xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M49.5259 25.6729C52.8523 27.5987 52.8523 32.4013 49.5259 34.3271L7.50518 58.6549C4.17185 60.5847 2.10133e-07 58.1794 3.7803e-07 54.3278L2.49896e-06 5.67224C2.66686e-06 1.82058 4.17185 -0.584717 7.50518 1.34511L49.5259 25.6729Z"
                                            fill="#F57520"/>
                                    </svg>
                                </button>
                            </div>
                            <p>
                                Новий Dogma F від Pinarello - це більш легкий, більш чуйний і аеродинамічний варіант
                                їхнього
                                останнього шосейного гоночного мотоцикла F12. І хоча загальний асиметричний
                                аеродинамічний
                                профіль залишається виразно знайомим із десятирічними кривими Pinarello Dogma,
                                найбільшим
                                сюрпризом може бути те, що тут річ не тільки в дисковому гальмі. У той час як багато
                                виробників велосипедів використовують тільки дискові гальма, професіонали Pinarello
                                продовжують вигравати Гранд-тури на велосипедах з ободними гальмами, тому Dogma F
                                продовжує
                                розвиватися як з ободними, так і з дисковими гальмами...
                            </p>
                        </section>
                        <section>
                            <h4>
                                2022 Pinarello Dogma F вигнутий аеродинамічний шосейний шосейний гоночний велосипед з
                                карбону
                            </h4>
                            <div className="row">
                                <img src="/images/blogItem/img_1.avif" alt=""/>
                                <div>
                                    <p>
                                        Форма нового шосейного аеродинамічного шосейного велосипеда Pinarello Dogma F не
                                        надто відрізняється від попередньої Dogma, за винятком більш плоского верху і
                                        трохи більш опущеного пір'я сидіння. Але що цікаво, номерне позначення було
                                        замінено з самої останньої Dogma F12 на цю нову Dogma F сьомого покоління, що,
                                        за словами Пінарелло, спрощує зв'язок мотоциклів з його давнім минулим (з 2000
                                        року) і його «незаперечною» перевагою, що тягнеться в майбутнє.
                                    </p>
                                    <p>
                                        Це також натяк на універсальність нового мотоцикла. У той час як у попередніх
                                        поколінь були версії для альпіністів або спринтерів, ця нова Pinarello Dogma F
                                        призначена для того, щоб стати збалансованим універсальним гонщиком.
                                    </p>
                                </div>
                            </div>
                        </section>
                        <section>
                            <h4>То що нового?</h4>
                            <div className="row">
                                <div>
                                    <p>
                                        У Pinarello кажуть, що новий комплект рами Dogma F Disc в кінцевому підсумку
                                        економить
                                        265 г порівняно з F12 Disc, більша частина яких приписується новим титановим
                                        компонентам, надрукованим на 3D-принтері за межами самої рами. Зокрема,
                                        підсідельний
                                        штир (-35 г у новій голівці ti), рульова колонка (-25 г), вилка Onda (-58 г),
                                        передня
                                        наскрізна вісь (-20 г) і кабіна Most Talon Ultra (-40 г) втратили всі грами.
                                        Сама рама,
                                        здається, досягла тієї ж оптимальної ваги ~850 г, на яку Pinarello орієнтувалася
                                        протягом багатьох років (53 см), хоча тепер каретка на 12% жорсткіша. (Фактична
                                        заявлена
                                        вага нефарбованої 53-сантиметрової рами диска - 865 г, вага рами обода - 860 г.)
                                    </p>
                                    <p>
                                        Повна вага велосипеда з дисковими гальмами, як і раніше, становить 6,8 кг з
                                        Dura-Ace Di2
                                        або 6,9 кг з карбоновими колесами SRAM Red AXS і DT (обидва розміри 53, без
                                        педалей).
                                        Обмеження UCI з аналогічними характеристиками для моделі з обідним гальмом.
                                    </p>
                                </div>
                                <img src="/images/blogItem/img_2.avif" alt=""/>
                            </div>
                        </section>
                        <section>
                            <h4>Наскільки швидше це насправді?</h4>
                            <div className="row">
                                <img src="/images/blogItem/img_3.avif" alt=""/>
                                <div>
                                    <p>
                                        Злегка опущене пір'я сидіння, що закриває їх плоским переходом до підсідельної
                                        труби, допомогло поліпшити аеродинаміку, а також додало комфорту в сідлі, що
                                        поглинає вібрацію.
                                    </p>
                                    <p>
                                        Оновлені правила UCI також дали змогу Pinarello зробити нову підсідельну трубу і
                                        підсідельний штир Dogma F вужчими, а також трохи поліпшити секцію нижньої труби,
                                        щоб ще більше зменшити опір.
                                    </p>
                                    <p>
                                        Пишна вилка Onda також абсолютно нова у варіантах з ободним і дисковим гальмом
                                        для меншого опору на вітрі, заснована на конструкції ноги вилки Bolide з
                                        аеродинамічним профілем.
                                    </p>
                                </div>
                            </div>
                        </section>
                        <section>
                            <h4>Наскільки швидше це насправді?</h4>
                            <div className="row">
                                <div>
                                    <p>
                                        Pinarello називає новий дисковий велосипед на 4,8% більш аеродинамічним, ніж
                                        попередній дисковий F12.
                                    </p>
                                    <p>
                                        Велосипед з ободним гальмом також трохи швидший, його аеродинаміка на 3,2%
                                        краща, ніж у ободного гальма F12. Це відносно незначні оновлення, але вони, як і
                                        раніше, вимагають економії до 2,6 Вт за умови гоночного темпу 50 км/год або
                                        навіть 1,3 Вт за більш керованих 40 км/год для решти з нас.
                                    </p>
                                </div>
                                <img src="/images/blogItem/img_4.avif" alt=""/>
                            </div>
                        </section>
                        <section>
                            <h4>Технічні подробиці</h4>
                            <div className="row">
                                <img src="/images/blogItem/img_5.avif" alt=""/>
                                <div>
                                    <p>
                                        Виготовлені з того ж японського вуглецевого волокна Toraya T1100 1K Dream з
                                        технологією Nanoalloy, велосипеди з електронним перемиканням передач і дисковими
                                        гальмами схвалені UCI і мають поліпшену асиметричну аеродинамічну раму Dogma F12
                                        останнього покоління з повністю внутрішнім прокладенням троса, заслінками вилки
                                        осі, гладкий, але все-таки зовнішній прихований затиск підсідельного штиря,
                                        багатопозиційні виступи фляготримача підсідельної труби і каретка з італійським
                                        різьбленням, вставна 1 5-5-дюймова прихована затиск підсідельної штиря,..,
                                        гладкий, але все ж таки зовнішній прихований затискач підсідельного штиря,
                                        багатопозиційні виступи фляготримача підсідельної труби, каретка з італійським
                                        різьбленням, вставна 1,5-дюймова пряма кермова колонка, плоскі диски та
                                        12-міліметрові наскрізні осі (модель із дисковим гальмом) та шина 28+ мм.
                                        кліренс на сучасних широких дисках.
                                    </p>
                                </div>
                            </div>
                        </section>
                        <section>
                            <h4>2022 Pinarello Dogma F - ціни, опції та доступність</h4>
                            <div className="row">
                                <div>
                                    <p>
                                        Як і в попередніх поколіннях, нова Dogma 2022 року, як і раніше, буде доступною
                                        як у моделях із дисковими гальмами Pinarello Dogma F, так і в ободних гальмах
                                        Dogma F, хоча реальне постачання споживачеві, імовірно, відбудеться ще
                                        щонайменше за кілька місяців. Комплекти рам Pinarello Dogma F 2022 року
                                        продаються вроздріб за ціною 5770 євро, незалежно від того, чи хочете ви ободні
                                        або дискові гальма.
                                    </p>
                                    <p>
                                        Обидва доступні з електронними трансмісіями вищого класу від Shimano, SRAM і
                                        Campagnolo, а також з карбоновими колісними парами, доступними у місцевого
                                        дилера Pinarello. Ціна на повний велосипед починається з 12 000 євро з ободними
                                        гальмами, але може швидко піднятися до 15 000 євро. з велосипедним дисковим
                                        гальмом з електронним перемиканням передач і карбоновими колесами преміум-класу.
                                    </p>
                                </div>
                                <img src="/images/blogItem/img_6.avif" alt=""/>
                            </div>
                        </section>
                        <section>
                            <h4></h4>
                            <div className="row">
                                <img src="/images/blogItem/img_7.avif" alt=""/>
                                <div>
                                    <p>
                                        Нова Dogma F доступна в 11 розмірах приклада, 16 розмірах керма/кабіни і 2
                                        зміщеннях підсідельного штиря, щоб відповідати будь-якому гонщику. Доступні три
                                        стандартні схеми забарвлення: Plutonium Flash з переходом від чорного до сірого,
                                        Eruption Red з переходом від чорного до червоного і повністю чорний на чорному.
                                    </p>
                                    <p>
                                        Цікаво, що єдині повні велосипеди, які ми бачили з групсетами Shimano, - це
                                        велосипеди Grenadier team edition, що мають лише обідні гальма і дебютують у
                                        перегонах Тур де Франс найближчими вихідними. Ми сприймемо це як ще один натяк
                                        на
                                        те, що скоро мають з'явитися нові групсети Dura-Ace...
                                    </p>
                                </div>
                            </div>
                        </section>
                        <hr/>
                        <div className="socials">
                            <span>Поділитися:</span>
                            <div className="socials__icons">
                                <a href="#" target="_blank" className="telegram">
                                    <svg viewBox="0 0 11 10" fill="none"
                                         xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M10.7016 1.11597L9.12372 9.35325C9.12372 9.35325 8.90295 9.92437 8.29648 9.65046L4.65597 6.75991L4.63908 6.75139C5.13083 6.29414 8.94407 2.7437 9.11073 2.58277C9.36873 2.33352 9.20856 2.18514 8.90901 2.37342L3.27638 6.07761L1.10332 5.32046C1.10332 5.32046 0.761348 5.19449 0.728449 4.92059C0.695117 4.64623 1.11458 4.49785 1.11458 4.49785L9.97346 0.899002C9.97346 0.899002 10.7016 0.567718 10.7016 1.11597Z"
                                            fill="white"/>
                                    </svg>
                                </a>
                                <a href="#" target="_blank" className="watsapp">
                                    <svg viewBox="0 0 13 12" fill="none"
                                         xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M10.3598 1.83291C9.27317 0.799316 7.82439 0.225098 6.29512 0.225098C3.11585 0.225098 0.540243 2.6751 0.540243 5.69932C0.540243 6.65635 0.821951 7.61338 1.30488 8.41728L0.5 11.2501L3.55854 10.4845C4.40366 10.9056 5.32927 11.1353 6.29512 11.1353C9.47439 11.1353 12.05 8.68525 12.05 5.66104C12.0098 4.24463 11.4463 2.8665 10.3598 1.83291ZM9.07195 7.65166C8.95122 7.95791 8.3878 8.26416 8.1061 8.30244C7.86463 8.34072 7.54268 8.34072 7.22073 8.26416C7.01951 8.1876 6.73781 8.11104 6.41585 7.95791C4.96707 7.38369 4.04146 6.00557 3.96098 5.89072C3.88049 5.81416 3.35732 5.16338 3.35732 4.47432C3.35732 3.78525 3.71951 3.479 3.84024 3.32588C3.96098 3.17275 4.12195 3.17275 4.24268 3.17275C4.32317 3.17275 4.4439 3.17275 4.52439 3.17275C4.60488 3.17275 4.72561 3.13447 4.84634 3.40244C4.96707 3.67041 5.24878 4.35947 5.28902 4.39775C5.32927 4.47432 5.32927 4.55088 5.28902 4.62744C5.24878 4.704 5.20854 4.78057 5.12805 4.85713C5.04756 4.93369 4.96707 5.04853 4.92683 5.08682C4.84634 5.16338 4.76585 5.23994 4.84634 5.35478C4.92683 5.50791 5.20854 5.929 5.65122 6.31182C6.21463 6.77119 6.65732 6.92432 6.81829 7.00088C6.97927 7.07744 7.05975 7.03916 7.14024 6.9626C7.22073 6.88603 7.50244 6.57979 7.58293 6.42666C7.66342 6.27354 7.78415 6.31182 7.90488 6.3501C8.02561 6.38838 8.75 6.73291 8.87073 6.80947C9.03171 6.88604 9.11219 6.92432 9.15244 6.9626C9.19268 7.07744 9.19268 7.34541 9.07195 7.65166Z"
                                            fill="white"/>
                                    </svg>
                                </a>
                                <a href="#" target="_blank" className="viber">
                                    <svg viewBox="0 0 12 13" fill="none"
                                         xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M8.78331 0.511702C6.78227 0.129563 4.70425 0.129563 2.70321 0.511702C1.81813 0.702772 0.70216 1.77276 0.509751 2.61347C0.163416 4.25667 0.163416 5.93808 0.509751 7.58128C0.740641 8.42199 1.85661 9.49198 2.70321 9.68305C2.74169 9.68305 2.78017 9.72127 2.78017 9.75948V12.167C2.78017 12.2816 2.9341 12.358 3.01106 12.2434L4.16551 11.0588C4.16551 11.0588 5.08907 10.1034 5.243 9.95055C5.243 9.95055 5.28148 9.91234 5.31996 9.91234C6.47441 9.95055 7.66734 9.83591 8.82179 9.64484C9.70687 9.45377 10.8228 8.38378 11.0152 7.54307C11.3616 5.89987 11.3616 4.21846 11.0152 2.57526C10.7844 1.77276 9.66839 0.702772 8.78331 0.511702ZM8.82179 7.69593C8.62939 8.07807 8.3985 8.38378 8.01368 8.57485C7.89823 8.61306 7.78279 8.65127 7.66734 8.68949C7.51342 8.65127 7.39797 8.61306 7.28253 8.57485C6.05111 8.07807 4.89666 7.39021 3.9731 6.39665C3.47284 5.82344 3.04954 5.1738 2.70321 4.48595C2.54928 4.14203 2.39535 3.83632 2.27991 3.49239C2.16446 3.18668 2.35687 2.88097 2.54928 2.65168C2.74169 2.4224 2.97258 2.26954 3.24195 2.1549C3.43436 2.04026 3.62677 2.11669 3.78069 2.26954C4.08855 2.65168 4.3964 3.03382 4.62729 3.45418C4.78122 3.72167 4.74273 4.02739 4.47336 4.21846C4.3964 4.25667 4.35792 4.29488 4.28095 4.37131C4.24247 4.40953 4.16551 4.44774 4.12703 4.52417C4.05006 4.63881 4.05006 4.75345 4.08855 4.86809C4.3964 5.74701 4.97362 6.43486 5.8587 6.817C6.01263 6.89343 6.12808 6.93165 6.32049 6.93165C6.58986 6.89343 6.7053 6.58772 6.89771 6.43486C7.09012 6.28201 7.32101 6.28201 7.5519 6.39665C7.74431 6.51129 7.93671 6.66415 8.1676 6.817C8.36001 6.96986 8.55242 7.0845 8.74483 7.23736C8.86027 7.31379 8.89876 7.50486 8.82179 7.69593ZM7.20556 4.82988C7.1286 4.82988 7.16708 4.82988 7.20556 4.82988C7.05164 4.82988 7.01315 4.75345 6.97467 4.63881C6.97467 4.56238 6.97467 4.44774 6.93619 4.37131C6.89771 4.21846 6.82075 4.0656 6.66682 3.95096C6.58986 3.91274 6.51289 3.87453 6.43593 3.83632C6.32048 3.7981 6.24352 3.7981 6.12808 3.7981C6.01263 3.75989 5.97415 3.68346 5.97415 3.56882C5.97415 3.49239 6.08959 3.41596 6.16656 3.41596C6.78227 3.45418 7.24404 3.7981 7.32101 4.52417C7.32101 4.56238 7.32101 4.63881 7.32101 4.67702C7.32101 4.75345 7.28253 4.82988 7.20556 4.82988ZM6.82074 3.14847C6.62834 3.07204 6.43593 2.99561 6.20504 2.9574C6.12808 2.9574 6.01263 2.91918 5.93567 2.91918C5.82022 2.91918 5.74326 2.84275 5.78174 2.72811C5.78174 2.61347 5.8587 2.53704 5.97415 2.57526C6.35897 2.61347 6.7053 2.6899 7.05164 2.84275C7.74431 3.18668 8.12912 3.75989 8.24457 4.52417C8.24457 4.56238 8.24457 4.6006 8.24457 4.63881C8.24457 4.71524 8.24457 4.79166 8.24457 4.90631C8.24457 4.94452 8.24457 4.98274 8.24457 5.02095C8.20609 5.17381 7.93672 5.21202 7.89823 5.02095C7.89823 4.98274 7.85975 4.90631 7.85975 4.86809C7.85975 4.52417 7.78279 4.18024 7.62886 3.87453C7.39797 3.5306 7.1286 3.30132 6.82074 3.14847ZM8.89876 5.4413C8.78331 5.4413 8.70635 5.32666 8.70635 5.21202C8.70635 4.98274 8.66787 4.75345 8.62939 4.52417C8.47546 3.30132 7.47494 2.30776 6.282 2.11669C6.0896 2.07847 5.89719 2.07847 5.74326 2.04026C5.62782 2.04026 5.47389 2.04026 5.43541 1.8874C5.39692 1.77276 5.51237 1.65812 5.62781 1.65812C5.6663 1.65812 5.70478 1.65812 5.70478 1.65812C5.78174 1.65812 7.28253 1.69633 5.70478 1.65812C7.32101 1.69633 8.66787 2.76633 8.93724 4.37131C8.97572 4.63881 9.0142 4.90631 9.0142 5.21202C9.09117 5.32666 9.0142 5.4413 8.89876 5.4413Z"
                                            fill="white"/>
                                    </svg>
                                </a>
                            </div>
                        </div>
                    </article>
                </Container>
                <Footer/>
            </Page>
            <Modal
                isActive={isActiveModal}
                onClose={() => setIsActiveModal(false)}
                className="video-modal odal"
            >
                <ReactPlayer
                    ref={playerRef}
                    url={videoUrl}
                    playing={isActiveModal}
                    className="video-player"
                    controls={true}
                    volume={0.1}
                    width="auto"
                    height="auto"
                />
            </Modal>
        </>
    );
};

export default BlogItemPage;