const Desc = () => {
    return (
        <article className="safeguards-desc">
            <p>
                Однією з важливих складових роботи нашого інтернет-магазину є те, що товари, які продаються,
                сертифіковані і забезпечені фірмовою гарантією фірм-виробників.
            </p>
            <p>
                Також, для зручності покупців, наш магазин допомагає (бере участь) у формуванні гарантійних запитів за
                всіма нижчепереліченими брендами. При будь-якому гарантійному випадку можна звертатися безпосередньо до
                нас.
            </p>
        </article>
    );
};

export default Desc;