import Accordeon from "../../../components/Accordeon.tsx";
import Container from "../../../components/Container.tsx";

const Questions = () => {
    return (
        <section className="questions">
            <Container>
                <h3>Часті запитання</h3>
                <div className="questions-wrap">
                    <Accordeon title="Чи отримаю я той самий товар, що й на картинці?">
                        Так, ви отримаєте саме той товар, що зображений на фото. Усі велосипеди відповідають опису та
                        актуальним зображенням на сайті.
                    </Accordeon>
                    <Accordeon title="Де я можу подивитися чек про покупку?">
                        Щоб переглянути чек про покупку, увійдіть до особистого кабінету на сайті магазину, у розділі
                        «Історія замовлень».
                    </Accordeon>
                    <Accordeon title="Як я можу повернути товар?">
                        Ви можете повернути товар протягом 14 днів після покупки, якщо він не був у використанні та
                        збережено товарний вигляд. Для цього зверніться до нашої служби підтримки або заповніть форму
                        повернення на сайті.
                    </Accordeon>
                    <Accordeon title="Чи будете ви поповнювати запаси товарів, позначених як «немає в наявності»?">
                        Так, ми регулярно оновлюємо запаси. Якщо товар позначений як «немає в наявності», ви можете
                        залишити свою електронну пошту на сторінці товару, і ми повідомимо, щойно він з’явиться.
                    </Accordeon>
                    <Accordeon title="З якими видами доставки ви працюєте?">
                        Нова пошта, Кур'єрська доставка, самовивіз із м.Київ.
                    </Accordeon>
                </div>
            </Container>
        </section>
    );
};

export default Questions;