const Content = () => {
    return (
        <section className="agreement-content-section">
            <h2>Угода користувача</h2>
            <div className="agreement__descs">
                <div className="agreement__desc t2">
                    Інтернет-магазин «https://world-bike.com», розташований на доменному імені: www.world-bike.com
                </div>
                <div className="agreement__desc t2">
                    <span className="upper-case">фоп петренко владислав васильович</span> іменований надалі «Продавець»,
                    публікує Публічну оферту про продаж Товару дистанційним способом
                </div>
            </div>
            <div className="agreement-content">
                <ol>
                    <li>
                        <span className="sub-h">визначення термінів</span>
                        <ol>
                            <li>
                                Публічна оферта (далі - «Оферта») - публічна пропозиція Продавця, адресована
                                невизначеному колу осіб, укласти з Продавцем договір купівлі-продажу товару
                                дистанційним
                                способом (далі - «Договір») на умовах, що містяться в цій Оферті, включно з усіма
                                Додатками.
                            </li>
                            <li>
                                Замовлення Товару на сайті Інтернет-магазину - позиції зазначені Покупцем з
                                асортименту
                                Товару, запропонованого до продажу, під час оформлення заявки на придбання Товару на
                                сайті
                                Інтернет-магазину або через Оператора.
                            </li>
                        </ol>
                    </li>
                    <li>
                        <span className="sub-h">загальні положення</span>
                        <ol>
                            <li>
                                Замовлення Покупцем Товару, розміщеного на сайті Інтернет-магазину, означає, що
                                Покупець згоден з усіма умовами цієї Оферти.
                            </li>
                            <li>
                                Замовлення Товару на сайті Інтернет-магазину - позиції зазначені Покупцем з
                                асортименту
                                Товару, запропонованого до продажу, під час оформлення заявки на придбання Товару на
                                сайті
                                Інтернет-магазину або через Оператора.
                            </li>
                        </ol>
                    </li>
                    <li>
                        <span className="sub-h">ціна товару</span>
                        <ol>
                            <li>
                                Ціна на кожну позицію Товару вказана на сайті Інтернет-магазину.
                            </li>
                            <li>
                                Продавець має право в односторонньому порядку змінити ціну на будь-яку позицію
                                Товару.
                            </li>
                            <li>
                                У разі зміни ціни на замовлений Товар Продавець зобов'язується протягом п'яти
                                робочих днів проінформувати Покупця про зміну ціни Товару.
                            </li>
                            <li>
                                Покупець має право підтвердити або анулювати Замовлення на придбання Товару, якщо
                                ціна змінена Продавцем після оформлення Замовлення.
                            </li>
                            <li>
                                Зміна Продавцем ціни на оплачений Покупцем Товар не допускається.
                            </li>
                            <li>
                                Продавець вказує вартість доставки Товару на сайті Інтернет-магазину або повідомляє
                                Покупця під час оформлення замовлення Оператором.
                            </li>
                            <li>
                                Зобов'язання Покупця з оплати Товару вважаються виконаними з моменту надходження
                                Продавцем грошових коштів.
                            </li>
                            <li>
                                Розрахунки між Продавцем і Покупцем за Товар здійснюються способами, зазначеними на
                                сайті Інтернет-магазину в розділі https://world-bike.com/pay/
                            </li>
                        </ol>
                    </li>
                    <li>
                        <span className="sub-h">оформлення замовлення</span>
                        <ol>
                            <li>
                                Заказ Товара осуществляется Покупателем через Оператора по телефону:
                                +38 099-56-75-885 или через сервис сайта Интернет-магазина https://world-bike.com
                            </li>
                            <li>
                                <span>
                                    При реєстрації на сайті Інтернет-магазину Покупець зобов'язується надати наступну
                                    реєстраційну інформацію:
                                </span>
                                <ul>
                                    <li>
                                        прізвище, ім'я, по батькові Покупця або зазначеної ним особи (одержувача)
                                    </li>
                                    <li>
                                        адресу, за якою слід доставити Товар (якщо доставка до адреси Покупця)
                                    </li>
                                    <li>
                                        адреса електронної пошти
                                    </li>
                                    <li>
                                        контактний телефон
                                    </li>
                                </ul>
                            </li>
                            <li>
                                Найменування, кількість, асортимент, артикул, ціна обраного Покупцем Товару
                                вказуються в кошику Покупця на сайті Інтернет-магазину.
                            </li>
                            <li>
                                Якщо Продавцю необхідна додаткова інформація, він має право запросити її у Покупця.
                                У разі ненадання необхідної інформації Покупцем, Продавець не несе відповідальності
                                за обраний Покупцем Товар.
                            </li>
                            <li>
                                При оформленні Замовлення через Оператора (п. 4.1. цієї Оферти) Покупець
                                зобов'язується надати інформацію, зазначену в п. 4.2. цієї Оферти.
                            </li>
                            <li>
                                Прийняття Покупцем умов цієї Оферти здійснюється за допомогою внесення Покупцем
                                відповідних даних в реєстраційну форму на сайті Інтернет-магазину або при оформленні
                                Замовлення через Оператора. Після оформлення Замовлення через Оператора дані про
                                Покупця реєструються в базі даних Продавця. Затвердивши Замовлення обраного Товару,
                                Покупець надає Оператору необхідну інформацію відповідно до порядку, зазначеному в
                                п. 4.2. цієї Оферти.
                            </li>
                            <li>
                                Продавець не несе відповідальності за зміст і достовірність інформації, наданої
                                Покупцем при оформленні Замовлення.
                            </li>
                            <li>
                                Договір купівлі-продажу дистанційним способом між Продавцем і Покупцем вважається
                                укладеним з моменту видачі Продавцем Покупцеві товарного чека або іншого документа,
                                що підтверджує оплату Товару.
                            </li>
                        </ol>
                    </li>
                    <li>
                        <span className="sub-h">доставка і передача товару покупцеві</span>
                        <ol>
                            <li>
                                Продавець надає Покупцеві послуги з доставки Товару одним із способів зазначених на
                                сайті Інтернет-магазину.
                            </li>
                            <li>
                                Якщо Договір купівлі-продажу товару дистанційним способом (далі - Договір) укладено
                                з умовою про доставку Товару Покупцю, Продавець зобов'язаний у встановлений
                                Договором строк доставити Товар у місце, зазначене Покупцем, а якщо місце доставки
                                Товару Покупцем не зазначено, то за місцем його проживання або реєстрації.
                            </li>
                            <li>
                                Місце доставки Товару Покупець вказує при оформленні Замовлення на придбання Товару.
                            </li>
                            <li>
                                Строк доставки Товару Покупцеві складається зі строку обробки замовлення та строку
                                доставки.
                            </li>
                            <li>
                                Доставлений Товар передається Покупцеві, а за відсутності Покупця - будь-якій особі,
                                яка пред'явила квитанцію або інший документ, що підтверджує укладення Договору або
                                оформлення доставки Товару.
                            </li>
                            <li>
                                Інформація про Товар доводиться до відома Покупця в технічній документації, що
                                додається до Товару, на етикетках, шляхом нанесення маркування або іншим способом,
                                прийнятим для окремих видів товарів.
                            </li>
                            <li>
                                Відомості про обов'язкове підтвердження відповідності Товару подаються в порядку і
                                способами, які встановлені законодавством Російської Федерації про технічне
                                регулювання, і включають відомості про номер документа, що підтверджує таку
                                відповідність, про термін його дії та про організацію, яка його видала.
                            </li>
                        </ol>
                    </li>
                    <li>
                        <span className="sub-h">повернення, обмін товару</span>
                        <ol>
                            <li>
                                Товар приймається на повернення в разі гарантійних поломок або заводського браку в
                                період гарантії, зазначений виробником,
                            </li>
                            <li>
                                По закінченню терміну гарантійного обслуговування заявленого виробником товару на
                                офіційному сайті, товари не приймаються на гарантійний ремонт або обмін.
                            </li>
                            <li>
                                Повернення або обмін товару протягом 14 календарних днів, здійснюється за правилами,
                                описаними в « Закон про захист прав споживачів, Стаття 25 »
                            </li>
                            <li>
                                Правила здачі товару за гарантією або обмін: Товар повинен мати повну комплектацію,
                                що відповідає опису на коробці, чистий вигляд, товарний чек. Здача товару
                                здійснюється за адресою: Україна, м.Київ, вул.Алмазова 45, (попередньо повідомити
                                про приїзд). Можливий забір товару кур'єром по Києву, на гарантійну оцінку або
                                обмін, вартість 300 грн.
                            </li>
                            <li>
                                Заявки на повернення або обмін товару здійснюються через форму Повернення товару.
                            </li>
                        </ol>
                    </li>
                    <li className="contacts-block">
                        <span className="sub-h">реквізити продавця / юридична інформація</span>
                        <ul>
                            <li>
                                Найменування: <span className="upper-case">фоп петренко владислав васильович</span>
                            </li>
                            <li>
                                РНОКПП: 402063939455
                            </li>
                            <li>
                                Юридична адреса: Україна, м.Київ, вул.Алмазова, буд.45
                            </li>
                            <li>
                                Фактична адреса: Україна, м.Київ, вул.Алмазова, буд.45
                            </li>
                            <li>
                                Розрахунковий рахунок: UA123456789012345678901234567
                            </li>
                            <li>
                                Банк: КБ "ПриватБанк"
                            </li>
                            <li>
                                Кореспондентський рахунок: 32009100000026
                            </li>
                            <li>
                                BIC: PBANUA2X
                            </li>
                        </ul>
                    </li>
                </ol>
            </div>
        </section>
    );
};

export default Content;