import Container from "../../../components/Container.tsx";

const Info = () => {
    return (
        <section className="storing-info">
            <Container>
                <p className="storing-info__article">
                    Любиш кататися - люби і велосипед у квартирі на зиму паркувати або здавай до нас на зберігання та
                    обслуговування. Типове зберігання велосипеда взимку у більшості людей не тільки займає простір у
                    коридорах на горищах і балконах, а й неабияк псує велосипед і його агрегати. Зберігання велосипеда в
                    квартирі часто перетворюється на велику проблему. А ми вас цінуємо дорогі клієнти і пропонуємо
                    вирішити цю проблему.
                </p>
                <div className="storing-info__wrap">
                    <div className="storing-info__block storing-info__block_1">
                        <h4>Зберігання велосипеда на 6 місяців з жовтня по квітень всього 2 000 грн.</h4>
                        <p>
                            Комплексне технічне обслуговування велосипеда в подарунок (замість 1500 ГРН.)
                        </p>
                    </div>
                    <div className="storing-info__block storing-info__block_2">
                        Ваш велосипед буде зберігатися в теплому і сухому приміщення протягом усього терміну зберігання.
                        Перед пакуванням велосипед оглядають і змащують для консервування, а під час видачі його вам
                        проводять комплексне технічне обслуговування.
                    </div>
                </div>
            </Container>
        </section>
    );
};

export default Info;